data/NASA_2DWMH_sweep/exp_tbl_komega_sharp_meshtop_180/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
265200
(
(-1.3480147841 9.88061564029e-05 -1.24929064777e-19)
(-1.3440441972 9.88087297875e-05 6.69901300542e-20)
(-1.34007352987 9.88074906133e-05 8.82908622328e-20)
(-1.33610293914 9.88074589681e-05 1.30071815686e-19)
(-1.33213235033 9.88074589681e-05 -2.72418436739e-19)
(-1.32816176151 9.88074590095e-05 -3.19212230987e-19)
(-1.3241911727 9.88074589266e-05 -1.0950180451e-19)
(-1.32022058388 9.88074590095e-05 -1.0066507151e-19)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
260
(
(-1.35 9.8807454157e-05 -1.01667603853e-19)
(-1.35 0.00029760864748 5.35436535952e-20)
(-1.35 0.000498796653392 -1.99773128897e-21)
(-1.35 0.000702400128029 8.38398040138e-21)
(-1.35 0.000908448071575 -2.40526233368e-20)
(-1.35 0.00111696983239 -7.67568521279e-20)
(-1.35 0.0013279951112 -3.52194079752e-21)
(-1.35 0.0015415539653 2.69109515428e-20)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
260
(
(0.84 9.8807454157e-05 1.01667603853e-19)
(0.84 0.00029760864748 -5.35436535952e-20)
(0.84 0.000498796653392 1.99773128897e-21)
(0.84 0.000702400128029 -8.38398040138e-21)
(0.84 0.000908448071575 2.40526233368e-20)
(0.84 0.00111696983239 7.67568521279e-20)
(0.84 0.0013279951112 3.52194079752e-21)
(0.84 0.0015415539653 -2.69109515428e-20)
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
1020
(
(-1.34801470588 0 -2.75258518408e-20)
(-1.34404411764 0 -8.5999991879e-22)
(-1.34007352941 0 7.02489388683e-20)
(-1.33610294118 0 -8.5999991879e-22)
(-1.33213235294 0 -2.75258518408e-20)
(-1.3281617647 0 3.46944695195e-20)
(-1.32419117647 0 -2.75258518408e-20)
(-1.32022058823 0 -8.5999991879e-22)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
1020
(
(-1.3482917819 0.35 -1.17337404796e-19)
(-1.34432589768 0.35 -3.42940409974e-21)
(-1.34007514991 0.35 6.2698287855e-20)
(-1.33609574632 0.35 -6.13465231825e-20)
(-1.33212310241 0.35 -3.46944695195e-20)
(-1.3281504585 0.35 8.96817805947e-20)
(-1.3241778146 0.35 -3.46944695195e-20)
(-1.32020517068 0.35 -3.46944695195e-20)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
