data/NASA_2DWMH_sweep/exp_tbl_komega_sharp_meshtop_180/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
265200
(
9.88061564029e-05
9.88087297875e-05
9.88074906133e-05
9.88074589681e-05
9.88074589681e-05
9.88074590095e-05
9.88074589266e-05
9.88074590095e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
260
(
9.8807454157e-05
0.00029760864748
0.000498796653392
0.000702400128029
0.000908448071575
0.00111696983239
0.0013279951112
0.0015415539653
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
260
(
9.8807454157e-05
0.00029760864748
0.000498796653392
0.000702400128029
0.000908448071575
0.00111696983239
0.0013279951112
0.0015415539653
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1020
(
0
0
0
0
0
0
0
0
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1020
(
0.35
0.35
0.35
0.35
0.35
0.35
0.35
0.35
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
