data/NASA_2DWMH_sweep/exp_tbl_komega_sharp_meshtop_180/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
265200
(
-1.24929064777e-19
6.69901300542e-20
8.82908622328e-20
1.30071815686e-19
-2.72418436739e-19
-3.19212230987e-19
-1.0950180451e-19
-1.0066507151e-19
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
260
(
-1.01667603853e-19
5.35436535952e-20
-1.99773128897e-21
8.38398040138e-21
-2.40526233368e-20
-7.67568521279e-20
-3.52194079752e-21
2.69109515428e-20
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
260
(
1.01667603853e-19
-5.35436535952e-20
1.99773128897e-21
-8.38398040138e-21
2.40526233368e-20
7.67568521279e-20
3.52194079752e-21
-2.69109515428e-20
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1020
(
-2.75258518408e-20
-8.5999991879e-22
7.02489388683e-20
-8.5999991879e-22
-2.75258518408e-20
3.46944695195e-20
-2.75258518408e-20
-8.5999991879e-22
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1020
(
-1.17337404796e-19
-3.42940409974e-21
6.2698287855e-20
-6.13465231825e-20
-3.46944695195e-20
8.96817805947e-20
-3.46944695195e-20
-3.46944695195e-20
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
