data/NASA_2DWMH_sweep/exp_tbl_komega_sharp_meshtop_180/system/residuals
type            residuals;
libs            ("libutilityFunctionObjects.so");
writeControl    timeStep;
writeInterval   1;

#include "../fieldDef"

fields          $residualFields;
